# 4. 판다스 데이터 쿼리 처리

In [1]:
import sqlite3

In [2]:
import pandas as pd

## 4-1 기본 테이블 확인하기

In [5]:
path = "../data/beat.db"

In [6]:
con = sqlite3.connect(path)

In [8]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", con)

   name
0  Band

In [9]:
pd.read_sql_query("SELECT * FROM Band;", con)

   id fname      lname  birthyear
0   0  Paul  McCartney       1942
1   1  John     Lennon       1940

## 4-2 다양한 테이블 확인하기

In [10]:
path1 = "../data/chinook.db"

In [13]:
con1 = sqlite3.connect(path1)

In [14]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", con1)

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [16]:
df_albums = pd.read_sql_query("SELECT * FROM albums;", con1)

In [17]:
df_albums.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [18]:
df_albums.tail()

     AlbumId                                              Title  ArtistId
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

## 4-3 데이터 조인 처리